In [15]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
from datetime import datetime

In [4]:
# read in the data with the headers beginning at line 2

dataframe = pd.read_csv('/Users/tinashem/LinkedIn Account Data/Basic_LinkedInDataExport_05-09-2024/Connections.csv', header=2)
dataframe.head()

,First Name,Last Name,URL,Email Address,Company,Position,Connected On
0,Matteo,Sollecito,https://www.linkedin.com/in/matteo-sollecito,NaN,Great Britain Baseball,Baseball Player,06 May 2024
1,Jonah,Pacis,https://www.linkedin.com/in/jonahpacis,NaN,Swarthmore College,Systems Toxicology & Neuroethology Research As...,06 May 2024
2,Kendall,Davis,https://www.linkedin.com/in/kendallrdavis,NaN,AT&T,Lead Manager: Media Reporting & Analytics (Mar...,30 Apr 2024
3,Tadiwa,Takawira,https://www.linkedin.com/in/tadiwanashetakawira,NaN,NaN,NaN,27 Apr 2024
4,Regina,Lloyd,https://www.linkedin.com/in/regina-lloyd-298a30b,NaN,Hopeloft,Bookkeeper and Payroll Specialist,23 Apr 2024

In [5]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 529 entries, 0 to 528
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First Name     525 non-null    object
 1   Last Name      525 non-null    object
 2   URL            525 non-null    object
 3   Email Address  6 non-null      object
 4   Company        498 non-null    object
 5   Position       499 non-null    object
 6   Connected On   529 non-null    object
dtypes: object(7)
memory usage: 29.1+ KB

In [6]:
dataframe[dataframe['First Name'].isnull()].head()

    First Name Last Name  URL Email Address Company Position Connected On
191        NaN       NaN  NaN           NaN     NaN      NaN  27 Jun 2023
406        NaN       NaN  NaN           NaN     NaN      NaN  01 Apr 2022
445        NaN       NaN  NaN           NaN     NaN      NaN  19 Oct 2020
494        NaN       NaN  NaN           NaN     NaN      NaN  04 Jul 2020

In [9]:
dataframe.drop([191,406,445,494], axis=0, inplace=True)
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
Index: 525 entries, 0 to 528
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First Name     525 non-null    object
 1   Last Name      525 non-null    object
 2   URL            525 non-null    object
 3   Email Address  6 non-null      object
 4   Company        498 non-null    object
 5   Position       499 non-null    object
 6   Connected On   525 non-null    object
dtypes: object(7)
memory usage: 32.8+ KB

In [10]:
dataframe.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       519, 520, 521, 522, 523, 524, 525, 526, 527, 528],
      dtype='int64', length=525)

In [11]:
dataframe.reset_index
dataframe.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       519, 520, 521, 522, 523, 524, 525, 526, 527, 528],
      dtype='int64', length=525)

In [12]:
dataframe.reset_index(inplace=True)

In [14]:
dataframe.index

RangeIndex(start=0, stop=525, step=1)

In [18]:
type(dataframe['Connected On'].values[0])

str

In [19]:
dataframe['Connected On'].values[0]

'06 May 2024'

### TODO: Convert 'Connected On' column to datetime format